home-manager.org
#+TITLE: Home Manager

* Common Packages
#+NAME: common-packages
#+BEGIN_SRC nix
## CLI

(aspellWithDicts (d: [d.en]))
(hunspellWithDicts (with hunspellDicts; [en-us]))
awscli
babashka
bat           # cat clone with syntax highlighting and git integration
bitwarden-cli
clojure
docker-compose
exiftool      # cli app for reading, writing and editing meta information
fd            # alternative to find
fzf           # cli fuzzy finder
git
git-lfs
gitAndTools.git-annex
httpie
jq
lazygit       # terminal UI for git
mediainfo     # unified display of technical and tag data for video and audio files
nixfmt        # Nix code formatter
nmap
nodejs
odt2txt       # for opendocument previews
openjdk
poppler_utils # for pdf previews
python3
python38Packages.pdftotext
ranger
ripgrep
rmapi         # cli tool for interacting with reMarkable cloud
shellcheck
tmuxp         # tmux workspace manager
w3m
yamllint
#+END_SRC
* Desktop Packages
#+NAME: desktop-packages
#+BEGIN_SRC nix
## Desktop

# X utils
flameshot     # screenshot tool
hacksaw       # area selection tool
nomacs        # image viewer
rofi
shotgun       # screenshot tool
wmctrl
xdotool
xdotool
xorg.xev
xorg.xprop
xorg.xwininfo

# Communication
discord
signal-desktop
slack

# Fonts
carlito

# Gnome utils
gnome3.dconf-editor

# Graphics
gimp
inkscape

# misc
appimage-run
bitwarden
brave
clj-kondo
clojure-lsp
emacs
ffmpegthumbnailer  # video thumbnailer
kitty
leafpad
libnotify
spotify
standardnotes
steam-run
wine
youtube-dl
zoom-us
#+END_SRC
** Tools for Thought
#+NAME: desktop-thinking-tools
#+BEGIN_SRC nix
# tools for thought
drawio
libreoffice
#yed
#+END_SRC
