docs/home-manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-18 Fri 21:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Home Manager</title>
<meta name="author" content="David Whittington" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Home Manager</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5bdcc54">1. Common Packages</a></li>
<li><a href="#orga243d12">2. Desktop Packages</a>
<ul>
<li><a href="#orgb1099c1">2.1. Tools for Thought</a></li>
</ul>
</li>
<li><a href="#org96a7af7">3. Dunst Config</a></li>
<li><a href="#org3f18fb3">4. CLI Config</a></li>
<li><a href="#orgc4b265f">5. Desktop Config</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5bdcc54" class="outline-2">
<h2 id="org5bdcc54"><span class="section-number-2">1</span> Common Packages</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-nix" id="orge1c35f1"><span style="color: #5B6268;">## </span><span style="color: #5B6268;">CLI</span>

(aspellWithDicts (d: [d.en]))
(hunspellWithDicts (<span style="color: #51afef;">with</span> hunspellDicts; [en-us]))
awscli
babashka
bat           <span style="color: #5B6268;"># cat clone with syntax highlighting and git integration</span>
bitwarden-cli
clojure
docker-compose
exiftool      <span style="color: #5B6268;"># cli app for reading, writing and editing meta information</span>
fd            <span style="color: #5B6268;"># alternative to find</span>
fzf           <span style="color: #5B6268;"># cli fuzzy finder</span>
git
git-lfs
gitAndTools.git-annex
httpie
jq
lazygit       <span style="color: #5B6268;"># terminal UI for git</span>
mediainfo     <span style="color: #5B6268;"># unified display of technical and tag data for video and audio files</span>
nixfmt        <span style="color: #5B6268;"># Nix code formatter</span>
nmap
nodejs
odt2txt       <span style="color: #5B6268;"># for opendocument previews</span>
openjdk
poppler_utils <span style="color: #5B6268;"># for pdf previews</span>
python3
python38Packages.pdftotext
ranger
ripgrep
rmapi         <span style="color: #5B6268;"># cli tool for interacting with reMarkable cloud</span>
shellcheck
tmuxp         <span style="color: #5B6268;"># tmux workspace manager</span>
w3m
yamllint
</pre>
</div>
</div>
</div>
<div id="outline-container-orga243d12" class="outline-2">
<h2 id="orga243d12"><span class="section-number-2">2</span> Desktop Packages</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-nix" id="org1bad159"><span style="color: #5B6268;">## </span><span style="color: #5B6268;">Desktop</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">X utils</span>
flameshot     <span style="color: #5B6268;"># screenshot tool</span>
hacksaw       <span style="color: #5B6268;"># area selection tool</span>
nomacs        <span style="color: #5B6268;"># image viewer</span>
rofi
shotgun       <span style="color: #5B6268;"># screenshot tool</span>
wmctrl
xdotool
xdotool
xorg.xev
xorg.xprop
xorg.xwininfo

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Communication</span>
discord
signal-desktop
slack

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Fonts</span>
carlito

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Gnome utils</span>
gnome3.dconf-editor

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Graphics</span>
gimp
inkscape

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">misc</span>
appimage-run
bitwarden
brave
clj-kondo
clojure-lsp
emacs
ffmpegthumbnailer  <span style="color: #5B6268;"># video thumbnailer</span>
leafpad
libnotify
spotify
standardnotes
steam-run
wine
youtube-dl
zoom-us
</pre>
</div>
</div>
<div id="outline-container-orgb1099c1" class="outline-3">
<h3 id="orgb1099c1"><span class="section-number-3">2.1</span> Tools for Thought</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-nix" id="org12b0d31"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">tools for thought</span>
drawio
libreoffice
<span style="color: #5B6268;">#</span><span style="color: #5B6268;">yed</span>
</pre>
</div>
</div>
</div>
</div>
